/* PART 1 
 * ➢ Создать класс Массив. 
 * ➢ Разработать service-классы реализующие функциональности:
 *   • поиск min\max значения массива, 
 *   • замену элементов массива по условию, 
 *   • определение среднего значения элементов массива, 
 *   • определение суммы элементов массива, 
 *   • определение числа положительных\отрицательных элементов массива. 
 *   
 *   PART 2 
 *   ➢ Сортировка массива тремя различными алгоритмами. 
 *   ➢ Параметры, необходимые для создания массивов, получить чтением информации из файла (.txt). 
 *   Часть данных должна быть некорректной. 
 *   Если встретилась некорректная строка, приложение должно переходить к следующей строке. 
 *   Чтение может быть прекращено по достижении первой корректной строки. 
 *   Файл данных должен находиться в отдельном каталоге. 
 *   ➢ Для чтения из файла можно использовать методы, появившиеся в Java8. 
 *   ➢ Использовать собственные классы исключительных ситуаций. 
 *   ➢ Разработать validation-классы для валидации исходных данных при создании массивов. 
 *   Например: корректная строка в файле для создания массива: «1, 2, 3» или «1 – 2 - 3» или «3 4 7»; 
 *   Некорректная строка в файле для создания массива: «1z1 21 32». 
 *   Присутствует недопустимый символ «z», следовательно всю строку следует считать некорректной.   
 *   
 *   PART 3 
 *   Решить задачи, поставленные в PART 1 и 2, с помощью возможностей IntStream. 
 */

package by.koroza.array.main;

public class Main {

	public static void main(String[] args) {
	}
}